const text = document.querySelector('.text')
const btn = document.querySelector('.btn-generate')

btn.addEventListener('click', () => {
  const compliment = ['Твои глаза и улыбка просто обворожительны.', 'Ты умница! Ты красавица! Ты моя принцесса!', 'Меня завораживают твои ямочки на щеках, когда ты улыбаешься.', 'В твоих глазах кусочек неба.', 'Все девушки — ангелы. Но ты особенный ангел! Ты — мой ангел-хранитель!', 'Ты — само совершенство! Сногсшибательна во всем.', 'У тебя такой выразительный взгляд, что я чувствую твои прикосновения на расстоянии.', 'Ты как магнит притягиваешь меня! Я с нетерпением жду встречи!', 'Ты мое ласковое весеннее солнышко.', 'Твоя улыбка сияет ярче солнца!', 'Ты — Королева Нежности! Ты — Царица Страсти! Ты — Богиня Любви!', 'У тебя потрясающий загар, словно смуглое пламя заката!', 'Этот насыщенный черный цвет волос тебе очень идет! Даже загар стал более бронзовым!', 'В этих очках ты похожа на молодую, строгую учительницу.', 'Ты самая сверкающая блондинка из всех блондинок на свете!', 'Блеск! Потрясающе! Превосходно выглядишь!']
  const random = Math.floor(Math.random() * compliment.length)
  const pharse = compliment[random]
  
  return text.textContent = `Лови шишку: ${pharse}`
})